src/cf/src/Documents/УстановкаПлановыхПоказателей/УстановкаПлановыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПлановыхПоказателей</name>
  <registerRecords>InformationRegister.ПлановыеПоказатели</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПлановыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>IDРодитель</name>
      <comment>Для связи в виде &quot;Дерево&quot;</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Characteristic.ПоказателиРасчётаПремий</types>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Characteristic.ПоказателиРасчётаПремий</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/ChartsOfCharacteristicTypes/ПоказателиРасчётаПремий/ПоказателиРасчётаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПоказателиРасчётаПремий</name>
  <type>
    <types>Boolean</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПремияПоПлану</name>
      <description>Prime selon le plan</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ФиксированнаяПремия</name>
      <description>Prime fixe</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтПродажСотрудника</name>
      <description>Pourcentage des ventes de l'employé</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтОбщегоОбъема</name>
      <description>Pourcentage du volume total</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПроцентОтПродажПодразделения</name>
      <description>Pourcentage des ventes du service</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>SMART</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажАнализировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажВариант</name>
    <type>
      <types>EnumRef.ВариантыАнализаПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажПоказатель</name>
    <type>
      <types>EnumRef.ПоказателиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Веса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОтработаннымДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧАнализПродажПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧКоэффициентыПремии</name>
    <attributes>
      <name>ВыполнениеПлана</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/src/Documents/УстановкаПлановыхПоказателей/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗСотрудники = Объект.ТЧПлановыеПоказатели.Выгрузить();
	ТЗСотрудники.Свернуть("Сотрудник");
	Для Каждого Стр Из ТЗСотрудники Цикл
		НС = ДЗПоказатели.ПолучитьЭлементы().Добавить();
		НС.СотрудникПоказатель = Стр.Сотрудник;
		НС.Уровень = 1;
		МасПоказатели = Объект.ТЧПлановыеПоказатели.НайтиСтроки(Новый Структура("Сотрудник, IDРодитель", Стр.Сотрудник, ОбщегоНазначенияКлиентСервер.ПустойID()));
		Для Каждого СтрПоказатель Из МасПоказатели Цикл
			НС2 = НС.ПолучитьЭлементы().Добавить();
			НС2.ID = СтрПоказатель.ID;
			НС2.СотрудникПоказатель = СтрПоказатель.Показатель;
			НС2.План = СтрПоказатель.План;
			НС2.Факт = СтрПоказатель.Факт;
			НС2.Стоимость = СтрПоказатель.Стоимость;
			НС2.Комментарий = СтрПоказатель.Комментарий;
			НС2.Уровень = 2;
			УстановитьПараметрыПоказателяВСтроке(НС2.ПолучитьИдентификатор());
			// Веса
			МасПоказателиВеса = Объект.ТЧПлановыеПоказатели.НайтиСтроки(Новый Структура("IDРодитель", СтрПоказатель.ID));
			Для Каждого СтрПоказательВес Из МасПоказателиВеса Цикл
				НС3 = НС2.ПолучитьЭлементы().Добавить();
				НС3.ID = СтрПоказательВес.ID;
				НС3.СотрудникПоказатель = СтрПоказательВес.Показатель;
				НС3.План = СтрПоказательВес.План;
				НС3.Факт = СтрПоказательВес.Факт;
				НС3.Стоимость = СтрПоказательВес.Стоимость;
				НС3.Комментарий = СтрПоказательВес.Комментарий;
				НС3.Уровень = 3;
				УстановитьПараметрыПоказателяВСтроке(НС3.ПолучитьИдентификатор());
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТЧПлановыеПоказатели.Очистить();
	Для Каждого Стр Из ДЗПоказатели.ПолучитьЭлементы() Цикл
		Для Каждого Стр2 Из Стр.ПолучитьЭлементы() Цикл
			НС = ТекущийОбъект.ТЧПлановыеПоказатели.Добавить();
			НС.ID = Стр2.ID;
			НС.Сотрудник = Стр.СотрудникПоказатель;
			НС.Показатель = Стр2.СотрудникПоказатель;
			НС.План = Стр2.План;
			НС.Факт = Стр2.Факт;
			НС.Стоимость = Стр2.Стоимость;
			НС.Комментарий = Стр2.Комментарий;
			Для Каждого Стр3 Из Стр2.ПолучитьЭлементы() Цикл
				НС = ТекущийОбъект.ТЧПлановыеПоказатели.Добавить();
				НС.ID = Стр3.ID;
				НС.IDРодитель = Стр2.ID;
				НС.Сотрудник = Стр.СотрудникПоказатель;
				НС.Показатель = Стр3.СотрудникПоказатель;
				НС.План = Стр3.План;
				НС.Факт = Стр3.Факт;
				НС.Стоимость = Стр3.Стоимость;
				НС.Комментарий = Стр3.Комментарий;	
			КонецЦикла	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Проверим, что сумма весов = 100%
	МожноЗаписать = Истина;
	Для Каждого СтрСотрудник Из ДЗПоказатели.ПолучитьЭлементы() Цикл
		Для Каждого СтрПоказатель Из СтрСотрудник.ПолучитьЭлементы() Цикл
			ПоказателиПоВесам = СтрПоказатель.ПолучитьЭлементы();
			Если ПоказателиПоВесам.Количество() = 0 Тогда Продолжить КонецЕсли;
			Вес = 100;
			Для Каждого СтрВес Из ПоказателиПоВесам Цикл
				Вес = Вес - СтрВес.Стоимость;	
			КонецЦикла;
			Если Вес <> 0 Тогда
				МожноЗаписать = Ложь;
				Сообщить("Сумма весов для показателя " + СокрЛП(СтрПоказатель.СотрудникПоказатель) + " у сотрудника " + СтрСотрудник.СотрудникПоказатель + " <> 100%");
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	Отказ = Не МожноЗаписать;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСотрудника", ЭтаФорма); 
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",, ЭтаФорма,,,, Оп);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоказатель(Команда)
	ТекСтр = Элементы.ДЗПоказатели.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		ПоказатьПредупреждение(, "Установите сотрудника");
		Возврат;
	КонецЕсли;
	Родитель = ПолучитьСтрокуРодитель(ТекСтр, 1);
	Если Родитель = Неопределено Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПоказателя", ЭтаФорма, Новый Структура("Родитель", Родитель)); 
	ОткрытьФорму("ПланВидовХарактеристик.ПоказателиРасчётаПремий.ФормаВыбора",, ЭтаФорма,,,, Оп);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВес(Команда)
	ТекСтр = Элементы.ДЗПоказатели.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		ПоказатьПредупреждение(, "Установите сотрудника");
		Возврат;
	КонецЕсли;
	Родитель = ПолучитьСтрокуРодитель(ТекСтр, 2);
	Если Родитель = Неопределено Или Не Родитель.АктивенВеса Тогда
		ПоказатьПредупреждение(, "Для выбранного показателя нельзя ввести веса");
		Возврат;	
	КонецЕсли;	
	Если Родитель = Неопределено Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПоказателяДляВеса", ЭтаФорма, Новый Структура("Родитель", Родитель)); 
	ОткрытьФорму("ПланВидовХарактеристик.ПоказателиРасчётаПремий.ФормаВыбора",, ЭтаФорма,,,, Оп);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	ТекСтр = Элементы.ДЗПоказатели.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите строку");
		Возврат;
	КонецЕсли;
	Эл = ДЗПоказатели.НайтиПоИдентификатору(Элементы.ДЗПоказатели.ТекущаяСтрока);	
	Родитель = ТекСтр.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		ДЗПоказатели.ПолучитьЭлементы().Удалить(Эл);	
	Иначе
	    Родитель.ПолучитьЭлементы().Удалить(Эл);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСотрудника(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Эл = ДЗПоказатели.ПолучитьЭлементы();
	Стр = Эл.Добавить();
	Стр.СотрудникПоказатель = РезультатЗакрытия;
	Стр.Уровень = 1;
	Элементы.ДЗПоказатели.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораПоказателя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Эл = ДополнительныеПараметры.Родитель.ПолучитьЭлементы();
	Стр = Эл.Добавить();
	Стр.ID = Новый УникальныйИдентификатор;
	Стр.СотрудникПоказатель = РезультатЗакрытия;
	Стр.Уровень = 2;
	УстановитьПараметрыПоказателяВСтроке(Стр.ПолучитьИдентификатор());
	Элементы.ДЗПоказатели.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораПоказателяДляВеса(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Эл = ДополнительныеПараметры.Родитель.ПолучитьЭлементы();
	Стр = Эл.Добавить();
	Стр.ID = Новый УникальныйИдентификатор;
	Стр.СотрудникПоказатель = РезультатЗакрытия;
	Стр.Уровень = 3;
	УстановитьПараметрыПоказателяВСтроке(Стр.ПолучитьИдентификатор());
	Элементы.ДЗПоказатели.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция ПолучитьСтрокуРодитель(Знач ТекСтр, НужныйУровень)
	Родитель = Неопределено;
	Пока ТекСтр <> Неопределено Цикл
		Если ТекСтр.Уровень <> НужныйУровень Тогда
			ТекСтр = ТекСтр.ПолучитьРодителя();	
		Иначе
			Родитель = ТекСтр;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат Родитель;
КонецФункции	

&НаСервере
Процедура УстановитьПараметрыПоказателяВСтроке(Идентификатор)	
	Стр = ДЗПоказатели.НайтиПоИдентификатору(Идентификатор);	
	Показатель = Стр.СотрудникПоказатель;
	// Установим активность ячеек
	Стр.АктивенПлан = Показатель.План;
	Стр.АктивенФакт = Показатель.SMART;
	Если Стр.Уровень = 2 Тогда
		Стр.АктивенВеса = Показатель.Веса;
		Стр.АктивенSMART = Показатель.SMART;	
	ИначеЕсли Стр.Уровень = 3 Тогда
		Стр.АктивенВеса = Ложь;
		Стр.АктивенSMART = Истина;
	КонецЕсли;
	// Проверим на заполнение данных
	Если Стр.АктивенПлан и Стр.План = Неопределено Тогда
		Стр.План = Показатель.ТипЗначения.ПривестиЗначение();	
	КонецЕсли;
	Если Стр.АктивенФакт и Стр.Факт = Неопределено Тогда
		Стр.Факт = Показатель.ТипЗначения.ПривестиЗначение();	
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
